import "Player.deca"


class IO {
	void printHello() {
		println();
		println();
		println();
		println();
		println();
		println();
		println();
		println();
		println();
		println();
		println();
		println();
		println();
		println("┼┼┼┼┼┼┼┼┼┼┼┼▄▀▀▀▄▄▄▄▄▄▄▀▀▀▄┼┼┼┼┼┼┼┼┼┼┼");
		println("┼┼┼┼┼┼┼┼┼┼┼┼█▒▒░░░░░░░░░▒▒█┼┼┼┼┼┼┼┼┼┼┼");
		println("┼┼┼┼┼┼┼┼┼┼┼┼┼█░░█░░░░░█░░█┼┼┼┼┼┼┼┼┼┼┼┼");
		println("┼┼┼┼┼┼┼┼┼─▄▄──█░░░▀█▀░░░█──▄▄─┼┼┼┼┼┼┼┼");
		println("┼┼┼┼┼┼┼┼┼█░░█─▀▄░░░░░░░▄▀─█░░█┼┼┼┼┼┼┼┼");
		println("┼┼┼┼┼┼██░██░████░██░░░██░░░█████┼┼┼┼┼┼");
		println("┼┼┼┼┼┼██▄██░██▄▄░██░░░██░░░██░██┼┼┼┼┼┼");
		println("┼┼┼┼┼┼██▀██░██▀▀░██░░░██░░░██░██┼┼┼┼┼┼");
		println("┼┼┼┼┼┼██░██░████░████░████░█████┼┼┼┼┼┼");
		println();
	}

	void printLink() {
		println("                          ††¥¥");
		println("                         ††††¥¥");
		println("                        ††††††¥¥");
		println("                       ††††††††¥¥");
		println("                      ††††††††††¥¥");
		println("                     ††††††††††††¥¥");
		println("                    ††††††††††††††¥¥");
		println("                   ††††††††††††††††¥¥");
		println("                  ††††††††††††††††††¥¥");
		println("                 ††††††††††††††††††††¥¥");
		println("                ††††††††††††††††††††††¥¥");
		println("               ††††††††††††††††††††††††¥¥");
		println("              ††††††††††††††††††††††††††¥¥");
		println("             ††††††††††††††††††††††††††††¥¥");
		println("            ††¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥††¥¥");
		println("           ††††¥¥¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯††††¥¥");
		println("          ††††††¥¥¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯††††††¥¥");
		println("         ††††††††¥¥¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯††††††††¥¥");
		println("        ††††††††††¥¥¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯††††††††††¥¥");
		println("       ††††††††††††¥¥¯¯¯¯¯¯¯¯¯¯¯¯¯¯††††††††††††¥¥");
		println("      ††††††††††††††¥¥¯¯¯¯¯¯¯¯¯¯¯¯††††††††††††††¥¥");
		println("     ††††††††††††††††¥¥¯¯¯¯¯¯¯¯¯¯††††††††††††††††¥¥");
		println("    ††††††††††††††††††¥¥¯¯¯¯¯¯¯¯††††††††††††††††††¥¥");
		println("   ††††††††††††††††††††¥¥¯¯¯¯¯¯††††††††††††††††††††¥¥");
		println("  ††††††††††††††††††††††¥¥¯¯¯¯††††††††††††††††††††††¥¥");
		println(" ††††††††††††††††††††††††¥¥¯¯††††††††††††††††††††††††¥¥");
		println("††††††††††††††††††††††††††††††††††††††††††††††††††††††¥¥");
		println("¯¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥");
		println("            ¶¶3333¶   ¶¶¶¶ÿÿÿÿ¶¶¶¶   ¶3333¶¶");
		println("            ¶¶33333¶ ¶ÿÿÿÿÿÿÿÿÿÿÿÿ¶ ¶33333¶¶");
		println("            ¶¶¶¶¶¶¶¶ÿÿ¶¶¶¶¶¶¶¶¶¶¶¶ÿÿ¶¶¶¶¶¶¶¶");
		println("            ¶¶0000¶¶¶77777777777777¶¶¶0000¶¶");
		println("            ¶¶0000¶¶7¶¶¶¶¶¶¶¶¶¶¶¶¶¶7¶¶0000¶¶");
		println("             ¶¶000¶¶¶a¯¯¶¶aaaa¶¶¯¯a¶¶¶000¶¶");
		println("             ¶¶000¶¶aa¯¯¶¶aaaa¶¶¯¯aa¶¶000¶¶");
		println("              ¶¶00¶¶aaa¯¯aaaaaa¯¯aaa¶¶00¶¶");
		println("               ¶¶000¶¶aaaaaaaaaaaa¶¶000¶¶");
		println("                ¶¶00¶¶¶¶aaaaaaaa¶¶¶¶00¶¶");
		println("                 ¶¶88888¶¶¶¶¶¶¶¶88888¶¶");
		println("                  ¶¶8855888888885588¶¶");
		println("                  ¶¶8855555555555588¶¶");
		println("                ¶¶11¶¶888855558888¶¶11¶¶");
		println("              ¶¶88881111¶¶1111¶¶11118888¶¶");
		println("              ¶¶¶¶¶¶8888111111118888¶¶¶¶¶¶");
		println("            ¶¶ƒƒ§§¶¶¶¶¶¶88888888¶¶¶¶¶¶§§ƒƒ¶¶");
		println("            ¶¶ƒƒƒƒ§§¶¶¯¶¶¶¶¶¶¶¶¶¶¯¶¶§§ƒƒƒƒ¶¶");
		println("            ¶¶¶¶¶¶¶¶¶              ");
	}

	boolean askVsWho() {
		int who;
		while (true) {
			print("Play against human (1) or IA (2): ");
			who = readInt();
			if (1 <= who && who <= 2) {
				return (who == 2);
			} else {
				println("Bad input, need to be 1 or 2.");
			}
		}

	}

	int askWhereToPlay(Grid grid) {
		boolean validNumber = false;
		int numBox;
		while (validNumber == false) {
			print("Where would you play (1 - 9): ");
			numBox = readInt();
			if (1 <= numBox && numBox <= 9) {
				if (grid.isBoxEmpty(numBox)) {
				validNumber = true;
				} else {
					println("This box is not empty!");
				}
			} else {
				println("Bad input, need to be between 1 and 9.");
			}
		}
		return numBox;
	}
}



{
	IO io = new IO();
	Grid grid = new Grid();
	Player player = new Player();
	IA ia = new IA();
	int numBox;
	boolean iaPlay;

	io.printHello();
	iaPlay = io.askVsWho();

	while (grid.isGameEnd() == 0) {
		print("Player ");
		println(player.num);
		grid.renderGrid();
		if (player.num == 1 || iaPlay == false) {
			numBox = io.askWhereToPlay(grid);
		} else {
			println("dans ia.play()");
			numBox = ia.play(grid);
		}

		grid.placeInBoxes(numBox, player.num);

		player.changePlayer();
		grid.boxDecrement();
	}

	grid.renderGrid();
	if (grid.isGameEnd() == -1) {
		println("Egalité ! 🤷");
	} else if (grid.isGameEnd() == 1 || iaPlay == false) {
		io.printLink();
		println("Bravo ! 🥳");
	} else {
		println("Cette IA est trop forte ! 🤖");
	}
}
